<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"4c8b4a456d051f179659ab9977a3e1fea533583a99698d907734fe63801c35e1","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1003 at https://github.com/cal-itp/data-infra/actions/runs/19450299348","plan_out_hash":"3981356e4e44bba9313d1b2ab5409806e14052c5fe5569836add2c73e54838c0","plan_hash":"a7e3255cb7850e9ca7abdcc2714ed6a8bea57f9f3f1ae47990e149656c24a8b1","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 5 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dbt_daily_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "suRrVA==" -> (known after apply)
!~      detect_md5hash      = "9jrrr0T6SwiHUqRKeX3HKQ==" -> "different hash"
!~      generation          = 1762466527713296 -> (known after apply)
        id                  = "calitp-composer-dags/dbt_daily_dag.py"
!~      md5hash             = "9jrrr0T6SwiHUqRKeX3HKQ==" -> (known after apply)
        name                = "dags/dbt_daily_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/dbt_payments_dag.py"] will be destroyed
  # (because key ["dags/dbt_payments_dag.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "4vph4g==" -> null
-       detect_md5hash      = "GchZs7ndSKhWlM09ph76Vw==" -> null
-       event_based_hold    = false -> null
-       generation          = 1759448629426812 -> null
-       id                  = "calitp-composer-dags/dbt_payments_dag.py" -> null
-       md5hash             = "GchZs7ndSKhWlM09ph76Vw==" -> null
-       md5hexhash          = "19c859b3b9dd48a85694cd3da61efa57" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/dags%2Fdbt_payments_dag.py?generation=1759448629426812&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/dbt_payments_dag.py" -> null
-       output_name         = "dags/dbt_payments_dag.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/dags%2Fdbt_payments_dag.py" -> null
-       source              = "../../../../airflow/dags/dbt_payments_dag.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "NXAN2A==" -> (known after apply)
!~      detect_md5hash      = "vafbc5EL/ZAqI8nZdG2B9Q==" -> "different hash"
!~      generation          = 1763057268528135 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "vafbc5EL/ZAqI8nZdG2B9Q==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/_src_gtfs_schedule_external_tables.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "JRuXXA==" -> (known after apply)
!~      detect_md5hash      = "Caqsk8kIhrzLrYxkwYo53g==" -> "different hash"
!~      generation          = 1751416666931203 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/_src_gtfs_schedule_external_tables.yml"
!~      md5hash             = "Caqsk8kIhrzLrYxkwYo53g==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/_src_gtfs_schedule_external_tables.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/_stg_gtfs.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "G4i6cQ==" -> (known after apply)
!~      detect_md5hash      = "ZIoZ9F+deaRCzQBuJSITkA==" -> "different hash"
!~      generation          = 1751416668944451 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/_stg_gtfs.yml"
!~      md5hash             = "ZIoZ9F+deaRCzQBuJSITkA==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/_stg_gtfs.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_schedule__download_configs.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-composer-dags" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/staging/gtfs/stg_gtfs_schedule__download_configs.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/staging/gtfs/stg_gtfs_schedule__download_configs.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "nykSZg==" -> (known after apply)
!~      detect_md5hash      = "gxcHOttOMwd6MwcijpwyWw==" -> "different hash"
!~      generation          = 1763057270242629 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "gxcHOttOMwd6MwcijpwyWw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1003](https://github.com/cal-itp/data-infra/actions/runs/19450299348)